Revit 2027 API
CylindricalHelix.YVector Property
The Y direction vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ YVector { get; }
Public ReadOnly Property YVector As XYZ
	Get
public:
property XYZ^ YVector {
	XYZ^ get ();
}
member YVector : XYZ with get
Property Value
XYZ
See Also
Reference
CylindricalHelix Class
Autodesk.Revit.DB Namespace